## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.azurerm_storage_account_blob_container_sas.storage_account_blob_container_sas will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_storage_account_blob_container_sas" "storage_account_blob_container_sas" {
      + connection_string = (sensitive value)
      + container_name    = "scdbsign-uat"
      + expiry            = "2026-01-01T00:00:00Z"
      + id                = (known after apply)
      + sas               = (sensitive value)
      + start             = "2024-01-01T00:00:00Z"

      + permissions {
          + add    = false
          + create = false
          + delete = false
          + list   = false
          + read   = true
          + write  = false
        }
    }

  # azurerm_application_insights.application_insights must be replaced
-/+ resource "azurerm_application_insights" "application_insights" {
      ~ app_id                                = "e02c4d11-6ab9-43ab-a0e8-87223cd96c75" -> (known after apply)
      ~ connection_string                     = (sensitive value)
      ~ daily_data_cap_in_gb                  = 100 -> (known after apply)
      ~ daily_data_cap_notifications_disabled = false -> (known after apply)
      ~ id                                    = "/subscriptions/0f1c072e-c866-4a84-929e-2ac38ef99c99/resourceGroups/rg-dropboxsign-uat/providers/Microsoft.Insights/components/ai-dropboxsign-uat" -> (known after apply)
      ~ instrumentation_key                   = (sensitive value)
      ~ name                                  = "ai-dropboxsign-uat" -> "ai-dbsign-uat" # forces replacement
      ~ resource_group_name                   = "rg-dropboxsign-uat" -> "rg-dbsign-uat" # forces replacement
      - tags                                  = {} -> null
        # (10 unchanged attributes hidden)
    }

  # azurerm_key_vault.vault must be replaced
-/+ resource "azurerm_key_vault" "vault" {
      ~ access_policy                   = [] -> (known after apply)
      - enabled_for_deployment          = false -> null
      - enabled_for_template_deployment = false -> null
      ~ id                              = "/subscriptions/0f1c072e-c866-4a84-929e-2ac38ef99c99/resourceGroups/rg-dropboxsign-uat/providers/Microsoft.KeyVault/vaults/kv-dropboxsign-uat" -> (known after apply)
      ~ name                            = "kv-dropboxsign-uat" -> "kv-dbsign-uat" # forces replacement
      ~ resource_group_name             = "rg-dropboxsign-uat" -> "rg-dbsign-uat" # forces replacement
      - tags                            = {} -> null
      ~ vault_uri                       = "https://kv-dropboxsign-uat.vault.azure.net/" -> (known after apply)
        # (8 unchanged attributes hidden)

      ~ contact {
          + access_policy                   = (known after apply)
          + enable_rbac_authorization       = (known after apply)
          + enabled_for_deployment          = (known after apply)
          + enabled_for_disk_encryption     = (known after apply)
          + enabled_for_template_deployment = (known after apply)
          + id                              = (known after apply)
          + location                        = (known after apply)
          + name                            = (known after apply)
          + public_network_access_enabled   = (known after apply)
          + purge_protection_enabled        = (known after apply)
          + resource_group_name             = (known after apply)
          + sku_name                        = (known after apply)
          + soft_delete_retention_days      = (known after apply)
          + tags                            = (known after apply)
          + tenant_id                       = (known after apply)
          + vault_uri                       = (known after apply)
        } -> (known after apply)

      ~ network_acls {
          + access_policy                   = (known after apply)
          + enable_rbac_authorization       = (known after apply)
          + enabled_for_deployment          = (known after apply)
          + enabled_for_disk_encryption     = (known after apply)
          + enabled_for_template_deployment = (known after apply)
          + id                              = (known after apply)
          + location                        = (known after apply)
          + name                            = (known after apply)
          + public_network_access_enabled   = (known after apply)
          + purge_protection_enabled        = (known after apply)
          + resource_group_name             = (known after apply)
          + sku_name                        = (known after apply)
          + soft_delete_retention_days      = (known after apply)
          + tags                            = (known after apply)
          + tenant_id                       = (known after apply)
          + vault_uri                       = (known after apply)
        } -> (known after apply)
    }

  # azurerm_key_vault_secret.access_token must be replaced
-/+ resource "azurerm_key_vault_secret" "access_token" {
      ~ id                      = "https://kv-dropboxsign-uat.vault.azure.net/secrets/dropBoxSignAccessToken/a58de0da97b4476ba4bed7dbceed2a35" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/0f1c072e-c866-4a84-929e-2ac38ef99c99/resourceGroups/rg-dropboxsign-uat/providers/Microsoft.KeyVault/vaults/kv-dropboxsign-uat" # forces replacement -> (known after apply) # forces replacement
        name                    = "dropBoxSignAccessToken"
      ~ resource_id             = "/subscriptions/0f1c072e-c866-4a84-929e-2ac38ef99c99/resourceGroups/rg-dropboxsign-uat/providers/Microsoft.KeyVault/vaults/kv-dropboxsign-uat/secrets/dropBoxSignAccessToken/versions/a58de0da97b4476ba4bed7dbceed2a35" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/0f1c072e-c866-4a84-929e-2ac38ef99c99/resourceGroups/rg-dropboxsign-uat/providers/Microsoft.KeyVault/vaults/kv-dropboxsign-uat/secrets/dropBoxSignAccessToken" -> (known after apply)
      - tags                    = {} -> null
      ~ version                 = "a58de0da97b4476ba4bed7dbceed2a35" -> (known after apply)
      ~ versionless_id          = "https://kv-dropboxsign-uat.vault.azure.net/secrets/dropBoxSignAccessToken" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.client_id must be replaced
-/+ resource "azurerm_key_vault_secret" "client_id" {
      ~ id                      = "https://kv-dropboxsign-uat.vault.azure.net/secrets/dropBoxSignClientID/747a1c6237164a3e9c996711379ec96a" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/0f1c072e-c866-4a84-929e-2ac38ef99c99/resourceGroups/rg-dropboxsign-uat/providers/Microsoft.KeyVault/vaults/kv-dropboxsign-uat" # forces replacement -> (known after apply) # forces replacement
        name                    = "dropBoxSignClientID"
      ~ resource_id             = "/subscriptions/0f1c072e-c866-4a84-929e-2ac38ef99c99/resourceGroups/rg-dropboxsign-uat/providers/Microsoft.KeyVault/vaults/kv-dropboxsign-uat/secrets/dropBoxSignClientID/versions/747a1c6237164a3e9c996711379ec96a" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/0f1c072e-c866-4a84-929e-2ac38ef99c99/resourceGroups/rg-dropboxsign-uat/providers/Microsoft.KeyVault/vaults/kv-dropboxsign-uat/secrets/dropBoxSignClientID" -> (known after apply)
      - tags                    = {} -> null
      ~ version                 = "747a1c6237164a3e9c996711379ec96a" -> (known after apply)
      ~ versionless_id          = "https://kv-dropboxsign-uat.vault.azure.net/secrets/dropBoxSignClientID" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.client_secret must be replaced
-/+ resource "azurerm_key_vault_secret" "client_secret" {
      ~ id                      = "https://kv-dropboxsign-uat.vault.azure.net/secrets/dropBoxSignClientSecret/db49b24f529047cb828e59c69724f73f" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/0f1c072e-c866-4a84-929e-2ac38ef99c99/resourceGroups/rg-dropboxsign-uat/providers/Microsoft.KeyVault/vaults/kv-dropboxsign-uat" # forces replacement -> (known after apply) # forces replacement
        name                    = "dropBoxSignClientSecret"
      ~ resource_id             = "/subscriptions/0f1c072e-c866-4a84-929e-2ac38ef99c99/resourceGroups/rg-dropboxsign-uat/providers/Microsoft.KeyVault/vaults/kv-dropboxsign-uat/secrets/dropBoxSignClientSecret/versions/db49b24f529047cb828e59c69724f73f" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/0f1c072e-c866-4a84-929e-2ac38ef99c99/resourceGroups/rg-dropboxsign-uat/providers/Microsoft.KeyVault/vaults/kv-dropboxsign-uat/secrets/dropBoxSignClientSecret" -> (known after apply)
      - tags                    = {} -> null
      ~ version                 = "db49b24f529047cb828e59c69724f73f" -> (known after apply)
      ~ versionless_id          = "https://kv-dropboxsign-uat.vault.azure.net/secrets/dropBoxSignClientSecret" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.refresh_token must be replaced
-/+ resource "azurerm_key_vault_secret" "refresh_token" {
      ~ id                      = "https://kv-dropboxsign-uat.vault.azure.net/secrets/dropBoxSignRefreshToken/e2d5cef8d23044959fd04b1bbe352941" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/0f1c072e-c866-4a84-929e-2ac38ef99c99/resourceGroups/rg-dropboxsign-uat/providers/Microsoft.KeyVault/vaults/kv-dropboxsign-uat" # forces replacement -> (known after apply) # forces replacement
        name                    = "dropBoxSignRefreshToken"
      ~ resource_id             = "/subscriptions/0f1c072e-c866-4a84-929e-2ac38ef99c99/resourceGroups/rg-dropboxsign-uat/providers/Microsoft.KeyVault/vaults/kv-dropboxsign-uat/secrets/dropBoxSignRefreshToken/versions/e2d5cef8d23044959fd04b1bbe352941" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/0f1c072e-c866-4a84-929e-2ac38ef99c99/resourceGroups/rg-dropboxsign-uat/providers/Microsoft.KeyVault/vaults/kv-dropboxsign-uat/secrets/dropBoxSignRefreshToken" -> (known after apply)
      - tags                    = {} -> null
      ~ version                 = "e2d5cef8d23044959fd04b1bbe352941" -> (known after apply)
      ~ versionless_id          = "https://kv-dropboxsign-uat.vault.azure.net/secrets/dropBoxSignRefreshToken" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # azurerm_linux_function_app.function_app will be created
  + resource "azurerm_linux_function_app" "function_app" {
      + app_settings                                   = (known after apply)
      + builtin_logging_enabled                        = true
      + client_certificate_enabled                     = false
      + client_certificate_mode                        = "Optional"
      + content_share_force_disabled                   = false
      + custom_domain_verification_id                  = (sensitive value)
      + daily_memory_time_quota                        = 0
      + default_hostname                               = (known after apply)
      + enabled                                        = true
      + ftp_publish_basic_authentication_enabled       = true
      + functions_extension_version                    = "~4"
      + hosting_environment_id                         = (known after apply)
      + https_only                                     = false
      + id                                             = (known after apply)
      + key_vault_reference_identity_id                = (known after apply)
      + kind                                           = (known after apply)
      + location                                       = "eastus"
      + name                                           = "func-dbsign-uat"
      + outbound_ip_address_list                       = (known after apply)
      + outbound_ip_addresses                          = (known after apply)
      + possible_outbound_ip_address_list              = (known after apply)
      + possible_outbound_ip_addresses                 = (known after apply)
      + public_network_access_enabled                  = true
      + resource_group_name                            = "rg-dbsign-uat"
      + service_plan_id                                = (known after apply)
      + site_credential                                = (sensitive value)
      + storage_account_access_key                     = (sensitive value)
      + storage_account_name                           = "stdbsignuatb3e1e7b0"
      + storage_uses_managed_identity                  = false
      + webdeploy_publish_basic_authentication_enabled = true
      + zip_deploy_file                                = (known after apply)

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "UserAssigned"
        }

      + site_config {
          + always_on                               = (known after apply)
          + app_scale_limit                         = (known after apply)
          + container_registry_use_managed_identity = false
          + default_documents                       = (known after apply)
          + detailed_error_logging_enabled          = (known after apply)
          + elastic_instance_minimum                = (known after apply)
          + ftps_state                              = "Disabled"
          + health_check_eviction_time_in_min       = (known after apply)
          + http2_enabled                           = false
          + ip_restriction_default_action           = "Allow"
          + linux_fx_version                        = (known after apply)
          + load_balancing_mode                     = "LeastRequests"
          + managed_pipeline_mode                   = "Integrated"
          + minimum_tls_version                     = "1.2"
          + pre_warmed_instance_count               = (known after apply)
          + remote_debugging_enabled                = false
          + remote_debugging_version                = (known after apply)
          + scm_ip_restriction_default_action       = "Allow"
          + scm_minimum_tls_version                 = "1.2"
          + scm_type                                = (known after apply)
          + scm_use_main_ip_restriction             = false
          + use_32_bit_worker                       = false
          + vnet_route_all_enabled                  = false
          + websockets_enabled                      = false
          + worker_count                            = (known after apply)

          + application_stack {
              + node_version                = "20"
              + use_dotnet_isolated_runtime = false
            }
        }
    }

  # azurerm_logic_app_workflow.logic_app must be replaced
-/+ resource "azurerm_logic_app_workflow" "logic_app" {
      ~ access_endpoint                    = "https://prod-59.eastus.logic.azure.com:443/workflows/e656d67bc15444beb78701687c2b91b1" -> (known after apply)
      ~ connector_endpoint_ip_addresses    = [] -> (known after apply)
      ~ connector_outbound_ip_addresses    = [
          - "40.71.249.139",
          - "40.71.249.205",
          - "40.114.40.132",
          - "40.71.11.80/28",
          - "40.71.15.160/27",
          - "52.188.157.160",
          - "20.88.153.176/28",
          - "20.88.153.192/27",
          - "52.151.221.184",
          - "52.151.221.119",
        ] -> (known after apply)
      ~ id                                 = "/subscriptions/0f1c072e-c866-4a84-929e-2ac38ef99c99/resourceGroups/rg-dropboxsign-uat/providers/Microsoft.Logic/workflows/lapp-dropboxsign-uat" -> (known after apply)
      ~ name                               = "lapp-dropboxsign-uat" -> "lapp-dbsign-uat" # forces replacement
      ~ resource_group_name                = "rg-dropboxsign-uat" -> "rg-dbsign-uat" # forces replacement
      - tags                               = {} -> null
      ~ workflow_endpoint_ip_addresses     = [
          - "137.135.106.54",
          - "40.117.99.79",
          - "40.117.100.228",
          - "137.116.126.165",
          - "52.226.216.209",
          - "40.76.151.124",
          - "20.84.29.150",
          - "40.76.174.148",
        ] -> (known after apply)
      ~ workflow_outbound_ip_addresses     = [
          - "13.92.98.111",
          - "40.121.91.41",
          - "40.114.82.191",
          - "23.101.139.153",
          - "23.100.29.190",
          - "23.101.136.201",
          - "104.45.153.81",
          - "23.101.132.208",
          - "52.226.216.197",
          - "52.226.216.187",
          - "40.76.151.25",
          - "40.76.148.50",
          - "20.84.29.29",
          - "20.84.29.18",
          - "40.76.174.83",
          - "40.76.174.39",
        ] -> (known after apply)
        # (6 unchanged attributes hidden)

      ~ identity {
          ~ identity_ids = [
              - "/subscriptions/0f1c072e-c866-4a84-929e-2ac38ef99c99/resourceGroups/rg-dropboxsign-uat/providers/Microsoft.ManagedIdentity/userAssignedIdentities/uai-dropboxsign-uat",
            ] -> (known after apply)
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # azurerm_resource_group.resource_group must be replaced
-/+ resource "azurerm_resource_group" "resource_group" {
      ~ id         = "/subscriptions/0f1c072e-c866-4a84-929e-2ac38ef99c99/resourceGroups/rg-dropboxsign-uat" -> (known after apply)
      ~ name       = "rg-dropboxsign-uat" -> "rg-dbsign-uat" # forces replacement
      - tags       = {} -> null
        # (2 unchanged attributes hidden)
    }

  # azurerm_role_assignment.current must be replaced
-/+ resource "azurerm_role_assignment" "current" {
      ~ id                                     = "/subscriptions/0f1c072e-c866-4a84-929e-2ac38ef99c99/resourceGroups/rg-dropboxsign-uat/providers/Microsoft.Authorization/roleAssignments/38e8d557-d86b-bc17-1601-a003de294a0c" -> (known after apply)
      ~ name                                   = "38e8d557-d86b-bc17-1601-a003de294a0c" -> (known after apply)
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/0f1c072e-c866-4a84-929e-2ac38ef99c99/providers/Microsoft.Authorization/roleDefinitions/b86a8fe4-44ce-4948-aee5-eccb2c155cd7" -> (known after apply)
      ~ scope                                  = "/subscriptions/0f1c072e-c866-4a84-929e-2ac38ef99c99/resourceGroups/rg-dropboxsign-uat" # forces replacement -> (known after apply) # forces replacement
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # azurerm_role_assignment.key_vault_access_role must be replaced
-/+ resource "azurerm_role_assignment" "key_vault_access_role" {
      ~ id                                     = "/subscriptions/0f1c072e-c866-4a84-929e-2ac38ef99c99/resourceGroups/rg-dropboxsign-uat/providers/Microsoft.Authorization/roleAssignments/b7bbf643-2cbc-34b4-028b-be9c29190543" -> (known after apply)
      ~ name                                   = "b7bbf643-2cbc-34b4-028b-be9c29190543" -> (known after apply)
      ~ principal_id                           = "cbe6439b-d927-433c-a13f-c7a7450e198c" # forces replacement -> (known after apply) # forces replacement
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/0f1c072e-c866-4a84-929e-2ac38ef99c99/providers/Microsoft.Authorization/roleDefinitions/b86a8fe4-44ce-4948-aee5-eccb2c155cd7" -> (known after apply)
      ~ scope                                  = "/subscriptions/0f1c072e-c866-4a84-929e-2ac38ef99c99/resourceGroups/rg-dropboxsign-uat" # forces replacement -> (known after apply) # forces replacement
      + skip_service_principal_aad_check       = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # azurerm_service_plan.app_service_plan_function must be replaced
-/+ resource "azurerm_service_plan" "app_service_plan_function" {
      ~ id                           = "/subscriptions/0f1c072e-c866-4a84-929e-2ac38ef99c99/resourceGroups/rg-dropboxsign-uat/providers/Microsoft.Web/serverFarms/asp-dropboxsign-uat-func" -> (known after apply)
      ~ kind                         = "functionapp" -> (known after apply)
      ~ maximum_elastic_worker_count = 1 -> (known after apply)
      ~ name                         = "asp-dropboxsign-uat-func" -> "asp-dbsign-uat-func" # forces replacement
      ~ reserved                     = true -> (known after apply)
      ~ resource_group_name          = "rg-dropboxsign-uat" -> "rg-dbsign-uat" # forces replacement
      - tags                         = {} -> null
      ~ worker_count                 = 0 -> (known after apply)
      - zone_balancing_enabled       = false -> null
        # (5 unchanged attributes hidden)
    }

  # azurerm_storage_account.storage_account must be replaced
-/+ resource "azurerm_storage_account" "storage_account" {
      ~ access_tier                        = "Hot" -> (known after apply)
      ~ id                                 = "/subscriptions/0f1c072e-c866-4a84-929e-2ac38ef99c99/resourceGroups/rg-dropboxsign-uat/providers/Microsoft.Storage/storageAccounts/stdropboxsignuatb3e1e7b0" -> (known after apply)
      + large_file_share_enabled           = (known after apply)
      ~ name                               = "stdropboxsignuatb3e1e7b0" -> "stdbsignuatb3e1e7b0" # forces replacement
      ~ primary_access_key                 = (sensitive value)
      ~ primary_blob_connection_string     = (sensitive value)
      ~ primary_blob_endpoint              = "https://stdropboxsignuatb3e1e7b0.blob.core.windows.net/" -> (known after apply)
      ~ primary_blob_host                  = "stdropboxsignuatb3e1e7b0.blob.core.windows.net" -> (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      ~ primary_connection_string          = (sensitive value)
      ~ primary_dfs_endpoint               = "https://stdropboxsignuatb3e1e7b0.dfs.core.windows.net/" -> (known after apply)
      ~ primary_dfs_host                   = "stdropboxsignuatb3e1e7b0.dfs.core.windows.net" -> (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      ~ primary_file_endpoint              = "https://stdropboxsignuatb3e1e7b0.file.core.windows.net/" -> (known after apply)
      ~ primary_file_host                  = "stdropboxsignuatb3e1e7b0.file.core.windows.net" -> (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      ~ primary_location                   = "eastus" -> (known after apply)
      ~ primary_queue_endpoint             = "https://stdropboxsignuatb3e1e7b0.queue.core.windows.net/" -> (known after apply)
      ~ primary_queue_host                 = "stdropboxsignuatb3e1e7b0.queue.core.windows.net" -> (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      ~ primary_table_endpoint             = "https://stdropboxsignuatb3e1e7b0.table.core.windows.net/" -> (known after apply)
      ~ primary_table_host                 = "stdropboxsignuatb3e1e7b0.table.core.windows.net" -> (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      ~ primary_web_endpoint               = "https://stdropboxsignuatb3e1e7b0.z13.web.core.windows.net/" -> (known after apply)
      ~ primary_web_host                   = "stdropboxsignuatb3e1e7b0.z13.web.core.windows.net" -> (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      ~ resource_group_name                = "rg-dropboxsign-uat" -> "rg-dbsign-uat" # forces replacement
      ~ secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      ~ secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
      - tags                               = {} -> null
        # (21 unchanged attributes hidden)

      ~ blob_properties {
          + access_tier                        = (known after apply)
          + account_kind                       = (known after apply)
          + account_replication_type           = (known after apply)
          + account_tier                       = (known after apply)
          + allow_nested_items_to_be_public    = (known after apply)
          + allowed_copy_scope                 = (known after apply)
          + cross_tenant_replication_enabled   = (known after apply)
          + default_to_oauth_authentication    = (known after apply)
          + dns_endpoint_type                  = (known after apply)
          + edge_zone                          = (known after apply)
          + enable_https_traffic_only          = (known after apply)
          + id                                 = (known after apply)
          + infrastructure_encryption_enabled  = (known after apply)
          + is_hns_enabled                     = (known after apply)
          + large_file_share_enabled           = (known after apply)
          + local_user_enabled                 = (known after apply)
          + location                           = (known after apply)
          + min_tls_version                    = (known after apply)
          + name                               = (known after apply)
          + nfsv3_enabled                      = (known after apply)
          + primary_access_key                 = (known after apply)
          + primary_blob_connection_string     = (known after apply)
          + primary_blob_endpoint              = (known after apply)
          + primary_blob_host                  = (known after apply)
          + primary_blob_internet_endpoint     = (known after apply)
          + primary_blob_internet_host         = (known after apply)
          + primary_blob_microsoft_endpoint    = (known after apply)
          + primary_blob_microsoft_host        = (known after apply)
          + primary_connection_string          = (known after apply)
          + primary_dfs_endpoint               = (known after apply)
          + primary_dfs_host                   = (known after apply)
          + primary_dfs_internet_endpoint      = (known after apply)
          + primary_dfs_internet_host          = (known after apply)
          + primary_dfs_microsoft_endpoint     = (known after apply)
          + primary_dfs_microsoft_host         = (known after apply)
          + primary_file_endpoint              = (known after apply)
          + primary_file_host                  = (known after apply)
          + primary_file_internet_endpoint     = (known after apply)
          + primary_file_internet_host         = (known after apply)
          + primary_file_microsoft_endpoint    = (known after apply)
          + primary_file_microsoft_host        = (known after apply)
          + primary_location                   = (known after apply)
          + primary_queue_endpoint             = (known after apply)
          + primary_queue_host                 = (known after apply)
          + primary_queue_microsoft_endpoint   = (known after apply)
          + primary_queue_microsoft_host       = (known after apply)
          + primary_table_endpoint             = (known after apply)
          + primary_table_host                 = (known after apply)
          + primary_table_microsoft_endpoint   = (known after apply)
          + primary_table_microsoft_host       = (known after apply)
          + primary_web_endpoint               = (known after apply)
          + primary_web_host                   = (known after apply)
          + primary_web_internet_endpoint      = (known after apply)
          + primary_web_internet_host          = (known after apply)
          + primary_web_microsoft_endpoint     = (known after apply)
          + primary_web_microsoft_host         = (known after apply)
          + public_network_access_enabled      = (known after apply)
          + queue_encryption_key_type          = (known after apply)
          + resource_group_name                = (known after apply)
          + secondary_access_key               = (known after apply)
          + secondary_blob_connection_string   = (known after apply)
          + secondary_blob_endpoint            = (known after apply)
          + secondary_blob_host                = (known after apply)
          + secondary_blob_internet_endpoint   = (known after apply)
          + secondary_blob_internet_host       = (known after apply)
          + secondary_blob_microsoft_endpoint  = (known after apply)
          + secondary_blob_microsoft_host      = (known after apply)
          + secondary_connection_string        = (known after apply)
          + secondary_dfs_endpoint             = (known after apply)
          + secondary_dfs_host                 = (known after apply)
          + secondary_dfs_internet_endpoint    = (known after apply)
          + secondary_dfs_internet_host        = (known after apply)
          + secondary_dfs_microsoft_endpoint   = (known after apply)
          + secondary_dfs_microsoft_host       = (known after apply)
          + secondary_file_endpoint            = (known after apply)
          + secondary_file_host                = (known after apply)
          + secondary_file_internet_endpoint   = (known after apply)
          + secondary_file_internet_host       = (known after apply)
          + secondary_file_microsoft_endpoint  = (known after apply)
          + secondary_file_microsoft_host      = (known after apply)
          + secondary_location                 = (known after apply)
          + secondary_queue_endpoint           = (known after apply)
          + secondary_queue_host               = (known after apply)
          + secondary_queue_microsoft_endpoint = (known after apply)
          + secondary_queue_microsoft_host     = (known after apply)
          + secondary_table_endpoint           = (known after apply)
          + secondary_table_host               = (known after apply)
          + secondary_table_microsoft_endpoint = (known after apply)
          + secondary_table_microsoft_host     = (known after apply)
          + secondary_web_endpoint             = (known after apply)
          + secondary_web_host                 = (known after apply)
          + secondary_web_internet_endpoint    = (known after apply)
          + secondary_web_internet_host        = (known after apply)
          + secondary_web_microsoft_endpoint   = (known after apply)
          + secondary_web_microsoft_host       = (known after apply)
          + sftp_enabled                       = (known after apply)
          + shared_access_key_enabled          = (known after apply)
          + table_encryption_key_type          = (known after apply)
          + tags                               = (known after apply)
        } -> (known after apply)

      ~ network_rules {
          + access_tier                        = (known after apply)
          + account_kind                       = (known after apply)
          + account_replication_type           = (known after apply)
          + account_tier                       = (known after apply)
          + allow_nested_items_to_be_public    = (known after apply)
          + allowed_copy_scope                 = (known after apply)
          + cross_tenant_replication_enabled   = (known after apply)
          + default_to_oauth_authentication    = (known after apply)
          + dns_endpoint_type                  = (known after apply)
          + edge_zone                          = (known after apply)
          + enable_https_traffic_only          = (known after apply)
          + id                                 = (known after apply)
          + infrastructure_encryption_enabled  = (known after apply)
          + is_hns_enabled                     = (known after apply)
          + large_file_share_enabled           = (known after apply)
          + local_user_enabled                 = (known after apply)
          + location                           = (known after apply)
          + min_tls_version                    = (known after apply)
          + name                               = (known after apply)
          + nfsv3_enabled                      = (known after apply)
          + primary_access_key                 = (known after apply)
          + primary_blob_connection_string     = (known after apply)
          + primary_blob_endpoint              = (known after apply)
          + primary_blob_host                  = (known after apply)
          + primary_blob_internet_endpoint     = (known after apply)
          + primary_blob_internet_host         = (known after apply)
          + primary_blob_microsoft_endpoint    = (known after apply)
          + primary_blob_microsoft_host        = (known after apply)
          + primary_connection_string          = (known after apply)
          + primary_dfs_endpoint               = (known after apply)
          + primary_dfs_host                   = (known after apply)
          + primary_dfs_internet_endpoint      = (known after apply)
          + primary_dfs_internet_host          = (known after apply)
          + primary_dfs_microsoft_endpoint     = (known after apply)
          + primary_dfs_microsoft_host         = (known after apply)
          + primary_file_endpoint              = (known after apply)
          + primary_file_host                  = (known after apply)
          + primary_file_internet_endpoint     = (known after apply)
          + primary_file_internet_host         = (known after apply)
          + primary_file_microsoft_endpoint    = (known after apply)
          + primary_file_microsoft_host        = (known after apply)
          + primary_location                   = (known after apply)
          + primary_queue_endpoint             = (known after apply)
          + primary_queue_host                 = (known after apply)
          + primary_queue_microsoft_endpoint   = (known after apply)
          + primary_queue_microsoft_host       = (known after apply)
          + primary_table_endpoint             = (known after apply)
          + primary_table_host                 = (known after apply)
          + primary_table_microsoft_endpoint   = (known after apply)
          + primary_table_microsoft_host       = (known after apply)
          + primary_web_endpoint               = (known after apply)
          + primary_web_host                   = (known after apply)
          + primary_web_internet_endpoint      = (known after apply)
          + primary_web_internet_host          = (known after apply)
          + primary_web_microsoft_endpoint     = (known after apply)
          + primary_web_microsoft_host         = (known after apply)
          + public_network_access_enabled      = (known after apply)
          + queue_encryption_key_type          = (known after apply)
          + resource_group_name                = (known after apply)
          + secondary_access_key               = (known after apply)
          + secondary_blob_connection_string   = (known after apply)
          + secondary_blob_endpoint            = (known after apply)
          + secondary_blob_host                = (known after apply)
          + secondary_blob_internet_endpoint   = (known after apply)
          + secondary_blob_internet_host       = (known after apply)
          + secondary_blob_microsoft_endpoint  = (known after apply)
          + secondary_blob_microsoft_host      = (known after apply)
          + secondary_connection_string        = (known after apply)
          + secondary_dfs_endpoint             = (known after apply)
          + secondary_dfs_host                 = (known after apply)
          + secondary_dfs_internet_endpoint    = (known after apply)
          + secondary_dfs_internet_host        = (known after apply)
          + secondary_dfs_microsoft_endpoint   = (known after apply)
          + secondary_dfs_microsoft_host       = (known after apply)
          + secondary_file_endpoint            = (known after apply)
          + secondary_file_host                = (known after apply)
          + secondary_file_internet_endpoint   = (known after apply)
          + secondary_file_internet_host       = (known after apply)
          + secondary_file_microsoft_endpoint  = (known after apply)
          + secondary_file_microsoft_host      = (known after apply)
          + secondary_location                 = (known after apply)
          + secondary_queue_endpoint           = (known after apply)
          + secondary_queue_host               = (known after apply)
          + secondary_queue_microsoft_endpoint = (known after apply)
          + secondary_queue_microsoft_host     = (known after apply)
          + secondary_table_endpoint           = (known after apply)
          + secondary_table_host               = (known after apply)
          + secondary_table_microsoft_endpoint = (known after apply)
          + secondary_table_microsoft_host     = (known after apply)
          + secondary_web_endpoint             = (known after apply)
          + secondary_web_host                 = (known after apply)
          + secondary_web_internet_endpoint    = (known after apply)
          + secondary_web_internet_host        = (known after apply)
          + secondary_web_microsoft_endpoint   = (known after apply)
          + secondary_web_microsoft_host       = (known after apply)
          + sftp_enabled                       = (known after apply)
          + shared_access_key_enabled          = (known after apply)
          + table_encryption_key_type          = (known after apply)
          + tags                               = (known after apply)
        } -> (known after apply)

      ~ queue_properties {
          + access_tier                        = (known after apply)
          + account_kind                       = (known after apply)
          + account_replication_type           = (known after apply)
          + account_tier                       = (known after apply)
          + allow_nested_items_to_be_public    = (known after apply)
          + allowed_copy_scope                 = (known after apply)
          + cross_tenant_replication_enabled   = (known after apply)
          + default_to_oauth_authentication    = (known after apply)
          + dns_endpoint_type                  = (known after apply)
          + edge_zone                          = (known after apply)
          + enable_https_traffic_only          = (known after apply)
          + id                                 = (known after apply)
          + infrastructure_encryption_enabled  = (known after apply)
          + is_hns_enabled                     = (known after apply)
          + large_file_share_enabled           = (known after apply)
          + local_user_enabled                 = (known after apply)
          + location                           = (known after apply)
          + min_tls_version                    = (known after apply)
          + name                               = (known after apply)
          + nfsv3_enabled                      = (known after apply)
          + primary_access_key                 = (known after apply)
          + primary_blob_connection_string     = (known after apply)
          + primary_blob_endpoint              = (known after apply)
          + primary_blob_host                  = (known after apply)
          + primary_blob_internet_endpoint     = (known after apply)
          + primary_blob_internet_host         = (known after apply)
          + primary_blob_microsoft_endpoint    = (known after apply)
          + primary_blob_microsoft_host        = (known after apply)
          + primary_connection_string          = (known after apply)
          + primary_dfs_endpoint               = (known after apply)
          + primary_dfs_host                   = (known after apply)
          + primary_dfs_internet_endpoint      = (known after apply)
          + primary_dfs_internet_host          = (known after apply)
          + primary_dfs_microsoft_endpoint     = (known after apply)
          + primary_dfs_microsoft_host         = (known after apply)
          + primary_file_endpoint              = (known after apply)
          + primary_file_host                  = (known after apply)
          + primary_file_internet_endpoint     = (known after apply)
          + primary_file_internet_host         = (known after apply)
          + primary_file_microsoft_endpoint    = (known after apply)
          + primary_file_microsoft_host        = (known after apply)
          + primary_location                   = (known after apply)
          + primary_queue_endpoint             = (known after apply)
          + primary_queue_host                 = (known after apply)
          + primary_queue_microsoft_endpoint   = (known after apply)
          + primary_queue_microsoft_host       = (known after apply)
          + primary_table_endpoint             = (known after apply)
          + primary_table_host                 = (known after apply)
          + primary_table_microsoft_endpoint   = (known after apply)
          + primary_table_microsoft_host       = (known after apply)
          + primary_web_endpoint               = (known after apply)
          + primary_web_host                   = (known after apply)
          + primary_web_internet_endpoint      = (known after apply)
          + primary_web_internet_host          = (known after apply)
          + primary_web_microsoft_endpoint     = (known after apply)
          + primary_web_microsoft_host         = (known after apply)
          + public_network_access_enabled      = (known after apply)
          + queue_encryption_key_type          = (known after apply)
          + resource_group_name                = (known after apply)
          + secondary_access_key               = (known after apply)
          + secondary_blob_connection_string   = (known after apply)
          + secondary_blob_endpoint            = (known after apply)
          + secondary_blob_host                = (known after apply)
          + secondary_blob_internet_endpoint   = (known after apply)
          + secondary_blob_internet_host       = (known after apply)
          + secondary_blob_microsoft_endpoint  = (known after apply)
          + secondary_blob_microsoft_host      = (known after apply)
          + secondary_connection_string        = (known after apply)
          + secondary_dfs_endpoint             = (known after apply)
          + secondary_dfs_host                 = (known after apply)
          + secondary_dfs_internet_endpoint    = (known after apply)
          + secondary_dfs_internet_host        = (known after apply)
          + secondary_dfs_microsoft_endpoint   = (known after apply)
          + secondary_dfs_microsoft_host       = (known after apply)
          + secondary_file_endpoint            = (known after apply)
          + secondary_file_host                = (known after apply)
          + secondary_file_internet_endpoint   = (known after apply)
          + secondary_file_internet_host       = (known after apply)
          + secondary_file_microsoft_endpoint  = (known after apply)
          + secondary_file_microsoft_host      = (known after apply)
          + secondary_location                 = (known after apply)
          + secondary_queue_endpoint           = (known after apply)
          + secondary_queue_host               = (known after apply)
          + secondary_queue_microsoft_endpoint = (known after apply)
          + secondary_queue_microsoft_host     = (known after apply)
          + secondary_table_endpoint           = (known after apply)
          + secondary_table_host               = (known after apply)
          + secondary_table_microsoft_endpoint = (known after apply)
          + secondary_table_microsoft_host     = (known after apply)
          + secondary_web_endpoint             = (known after apply)
          + secondary_web_host                 = (known after apply)
          + secondary_web_internet_endpoint    = (known after apply)
          + secondary_web_internet_host        = (known after apply)
          + secondary_web_microsoft_endpoint   = (known after apply)
          + secondary_web_microsoft_host       = (known after apply)
          + sftp_enabled                       = (known after apply)
          + shared_access_key_enabled          = (known after apply)
          + table_encryption_key_type          = (known after apply)
          + tags                               = (known after apply)
        } -> (known after apply)

      ~ routing {
          + access_tier                        = (known after apply)
          + account_kind                       = (known after apply)
          + account_replication_type           = (known after apply)
          + account_tier                       = (known after apply)
          + allow_nested_items_to_be_public    = (known after apply)
          + allowed_copy_scope                 = (known after apply)
          + cross_tenant_replication_enabled   = (known after apply)
          + default_to_oauth_authentication    = (known after apply)
          + dns_endpoint_type                  = (known after apply)
          + edge_zone                          = (known after apply)
          + enable_https_traffic_only          = (known after apply)
          + id                                 = (known after apply)
          + infrastructure_encryption_enabled  = (known after apply)
          + is_hns_enabled                     = (known after apply)
          + large_file_share_enabled           = (known after apply)
          + local_user_enabled                 = (known after apply)
          + location                           = (known after apply)
          + min_tls_version                    = (known after apply)
          + name                               = (known after apply)
          + nfsv3_enabled                      = (known after apply)
          + primary_access_key                 = (known after apply)
          + primary_blob_connection_string     = (known after apply)
          + primary_blob_endpoint              = (known after apply)
          + primary_blob_host                  = (known after apply)
          + primary_blob_internet_endpoint     = (known after apply)
          + primary_blob_internet_host         = (known after apply)
          + primary_blob_microsoft_endpoint    = (known after apply)
          + primary_blob_microsoft_host        = (known after apply)
          + primary_connection_string          = (known after apply)
          + primary_dfs_endpoint               = (known after apply)
          + primary_dfs_host                   = (known after apply)
          + primary_dfs_internet_endpoint      = (known after apply)
          + primary_dfs_internet_host          = (known after apply)
          + primary_dfs_microsoft_endpoint     = (known after apply)
          + primary_dfs_microsoft_host         = (known after apply)
          + primary_file_endpoint              = (known after apply)
          + primary_file_host                  = (known after apply)
          + primary_file_internet_endpoint     = (known after apply)
          + primary_file_internet_host         = (known after apply)
          + primary_file_microsoft_endpoint    = (known after apply)
          + primary_file_microsoft_host        = (known after apply)
          + primary_location                   = (known after apply)
          + primary_queue_endpoint             = (known after apply)
          + primary_queue_host                 = (known after apply)
          + primary_queue_microsoft_endpoint   = (known after apply)
          + primary_queue_microsoft_host       = (known after apply)
          + primary_table_endpoint             = (known after apply)
          + primary_table_host                 = (known after apply)
          + primary_table_microsoft_endpoint   = (known after apply)
          + primary_table_microsoft_host       = (known after apply)
          + primary_web_endpoint               = (known after apply)
          + primary_web_host                   = (known after apply)
          + primary_web_internet_endpoint      = (known after apply)
          + primary_web_internet_host          = (known after apply)
          + primary_web_microsoft_endpoint     = (known after apply)
          + primary_web_microsoft_host         = (known after apply)
          + public_network_access_enabled      = (known after apply)
          + queue_encryption_key_type          = (known after apply)
          + resource_group_name                = (known after apply)
          + secondary_access_key               = (known after apply)
          + secondary_blob_connection_string   = (known after apply)
          + secondary_blob_endpoint            = (known after apply)
          + secondary_blob_host                = (known after apply)
          + secondary_blob_internet_endpoint   = (known after apply)
          + secondary_blob_internet_host       = (known after apply)
          + secondary_blob_microsoft_endpoint  = (known after apply)
          + secondary_blob_microsoft_host      = (known after apply)
          + secondary_connection_string        = (known after apply)
          + secondary_dfs_endpoint             = (known after apply)
          + secondary_dfs_host                 = (known after apply)
          + secondary_dfs_internet_endpoint    = (known after apply)
          + secondary_dfs_internet_host        = (known after apply)
          + secondary_dfs_microsoft_endpoint   = (known after apply)
          + secondary_dfs_microsoft_host       = (known after apply)
          + secondary_file_endpoint            = (known after apply)
          + secondary_file_host                = (known after apply)
          + secondary_file_internet_endpoint   = (known after apply)
          + secondary_file_internet_host       = (known after apply)
          + secondary_file_microsoft_endpoint  = (known after apply)
          + secondary_file_microsoft_host      = (known after apply)
          + secondary_location                 = (known after apply)
          + secondary_queue_endpoint           = (known after apply)
          + secondary_queue_host               = (known after apply)
          + secondary_queue_microsoft_endpoint = (known after apply)
          + secondary_queue_microsoft_host     = (known after apply)
          + secondary_table_endpoint           = (known after apply)
          + secondary_table_host               = (known after apply)
          + secondary_table_microsoft_endpoint = (known after apply)
          + secondary_table_microsoft_host     = (known after apply)
          + secondary_web_endpoint             = (known after apply)
          + secondary_web_host                 = (known after apply)
          + secondary_web_internet_endpoint    = (known after apply)
          + secondary_web_internet_host        = (known after apply)
          + secondary_web_microsoft_endpoint   = (known after apply)
          + secondary_web_microsoft_host       = (known after apply)
          + sftp_enabled                       = (known after apply)
          + shared_access_key_enabled          = (known after apply)
          + table_encryption_key_type          = (known after apply)
          + tags                               = (known after apply)
        } -> (known after apply)

      ~ share_properties {
          + access_tier                        = (known after apply)
          + account_kind                       = (known after apply)
          + account_replication_type           = (known after apply)
          + account_tier                       = (known after apply)
          + allow_nested_items_to_be_public    = (known after apply)
          + allowed_copy_scope                 = (known after apply)
          + cross_tenant_replication_enabled   = (known after apply)
          + default_to_oauth_authentication    = (known after apply)
          + dns_endpoint_type                  = (known after apply)
          + edge_zone                          = (known after apply)
          + enable_https_traffic_only          = (known after apply)
          + id                                 = (known after apply)
          + infrastructure_encryption_enabled  = (known after apply)
          + is_hns_enabled                     = (known after apply)
          + large_file_share_enabled           = (known after apply)
          + local_user_enabled                 = (known after apply)
          + location                           = (known after apply)
          + min_tls_version                    = (known after apply)
          + name                               = (known after apply)
          + nfsv3_enabled                      = (known after apply)
          + primary_access_key                 = (known after apply)
          + primary_blob_connection_string     = (known after apply)
          + primary_blob_endpoint              = (known after apply)
          + primary_blob_host                  = (known after apply)
          + primary_blob_internet_endpoint     = (known after apply)
          + primary_blob_internet_host         = (known after apply)
          + primary_blob_microsoft_endpoint    = (known after apply)
          + primary_blob_microsoft_host        = (known after apply)
          + primary_connection_string          = (known after apply)
          + primary_dfs_endpoint               = (known after apply)
          + primary_dfs_host                   = (known after apply)
          + primary_dfs_internet_endpoint      = (known after apply)
          + primary_dfs_internet_host          = (known after apply)
          + primary_dfs_microsoft_endpoint     = (known after apply)
          + primary_dfs_microsoft_host         = (known after apply)
          + primary_file_endpoint              = (known after apply)
          + primary_file_host                  = (known after apply)
          + primary_file_internet_endpoint     = (known after apply)
          + primary_file_internet_host         = (known after apply)
          + primary_file_microsoft_endpoint    = (known after apply)
          + primary_file_microsoft_host        = (known after apply)
          + primary_location                   = (known after apply)
          + primary_queue_endpoint             = (known after apply)
          + primary_queue_host                 = (known after apply)
          + primary_queue_microsoft_endpoint   = (known after apply)
          + primary_queue_microsoft_host       = (known after apply)
          + primary_table_endpoint             = (known after apply)
          + primary_table_host                 = (known after apply)
          + primary_table_microsoft_endpoint   = (known after apply)
          + primary_table_microsoft_host       = (known after apply)
          + primary_web_endpoint               = (known after apply)
          + primary_web_host                   = (known after apply)
          + primary_web_internet_endpoint      = (known after apply)
          + primary_web_internet_host          = (known after apply)
          + primary_web_microsoft_endpoint     = (known after apply)
          + primary_web_microsoft_host         = (known after apply)
          + public_network_access_enabled      = (known after apply)
          + queue_encryption_key_type          = (known after apply)
          + resource_group_name                = (known after apply)
          + secondary_access_key               = (known after apply)
          + secondary_blob_connection_string   = (known after apply)
          + secondary_blob_endpoint            = (known after apply)
          + secondary_blob_host                = (known after apply)
          + secondary_blob_internet_endpoint   = (known after apply)
          + secondary_blob_internet_host       = (known after apply)
          + secondary_blob_microsoft_endpoint  = (known after apply)
          + secondary_blob_microsoft_host      = (known after apply)
          + secondary_connection_string        = (known after apply)
          + secondary_dfs_endpoint             = (known after apply)
          + secondary_dfs_host                 = (known after apply)
          + secondary_dfs_internet_endpoint    = (known after apply)
          + secondary_dfs_internet_host        = (known after apply)
          + secondary_dfs_microsoft_endpoint   = (known after apply)
          + secondary_dfs_microsoft_host       = (known after apply)
          + secondary_file_endpoint            = (known after apply)
          + secondary_file_host                = (known after apply)
          + secondary_file_internet_endpoint   = (known after apply)
          + secondary_file_internet_host       = (known after apply)
          + secondary_file_microsoft_endpoint  = (known after apply)
          + secondary_file_microsoft_host      = (known after apply)
          + secondary_location                 = (known after apply)
          + secondary_queue_endpoint           = (known after apply)
          + secondary_queue_host               = (known after apply)
          + secondary_queue_microsoft_endpoint = (known after apply)
          + secondary_queue_microsoft_host     = (known after apply)
          + secondary_table_endpoint           = (known after apply)
          + secondary_table_host               = (known after apply)
          + secondary_table_microsoft_endpoint = (known after apply)
          + secondary_table_microsoft_host     = (known after apply)
          + secondary_web_endpoint             = (known after apply)
          + secondary_web_host                 = (known after apply)
          + secondary_web_internet_endpoint    = (known after apply)
          + secondary_web_internet_host        = (known after apply)
          + secondary_web_microsoft_endpoint   = (known after apply)
          + secondary_web_microsoft_host       = (known after apply)
          + sftp_enabled                       = (known after apply)
          + shared_access_key_enabled          = (known after apply)
          + table_encryption_key_type          = (known after apply)
          + tags                               = (known after apply)
        } -> (known after apply)
    }

  # azurerm_storage_blob.storage_blob will be created
  + resource "azurerm_storage_blob" "storage_blob" {
      + access_tier            = (known after apply)
      + content_type           = "application/octet-stream"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = "784619dc691f1cdb6f56a139356d881ece86b887fcbc20c5e45ce5a5fcd13804.zip"
      + parallelism            = 8
      + size                   = 0
      + source                 = "./../../../build/function-app.zip"
      + storage_account_name   = "stdbsignuatb3e1e7b0"
      + storage_container_name = "scdbsign-uat"
      + type                   = "Block"
      + url                    = (known after apply)
    }

  # azurerm_storage_container.storage_container must be replaced
-/+ resource "azurerm_storage_container" "storage_container" {
      ~ default_encryption_scope          = "$account-encryption-key" -> (known after apply)
      ~ has_immutability_policy           = false -> (known after apply)
      ~ has_legal_hold                    = false -> (known after apply)
      ~ id                                = "https://stdropboxsignuatb3e1e7b0.blob.core.windows.net/scdropboxsign-uat" -> (known after apply)
      ~ metadata                          = {} -> (known after apply)
      ~ name                              = "scdropboxsign-uat" -> "scdbsign-uat" # forces replacement
      ~ resource_manager_id               = "/subscriptions/0f1c072e-c866-4a84-929e-2ac38ef99c99/resourceGroups/rg-dropboxsign-uat/providers/Microsoft.Storage/storageAccounts/stdropboxsignuatb3e1e7b0/blobServices/default/containers/scdropboxsign-uat" -> (known after apply)
      ~ storage_account_name              = "stdropboxsignuatb3e1e7b0" -> "stdbsignuatb3e1e7b0" # forces replacement
        # (2 unchanged attributes hidden)
    }

  # azurerm_user_assigned_identity.key_vault_access must be replaced
-/+ resource "azurerm_user_assigned_identity" "key_vault_access" {
      ~ client_id           = "fccf8cab-9efb-4566-b51b-fe1c9fc3c4ab" -> (known after apply)
      ~ id                  = "/subscriptions/0f1c072e-c866-4a84-929e-2ac38ef99c99/resourceGroups/rg-dropboxsign-uat/providers/Microsoft.ManagedIdentity/userAssignedIdentities/uai-dropboxsign-uat" -> (known after apply)
      ~ name                = "uai-dropboxsign-uat" -> "uai-dbsign-uat" # forces replacement
      ~ principal_id        = "cbe6439b-d927-433c-a13f-c7a7450e198c" -> (known after apply)
      ~ resource_group_name = "rg-dropboxsign-uat" -> "rg-dbsign-uat" # forces replacement
      - tags                = {} -> null
      ~ tenant_id           = "79286924-9f70-4485-9c60-dd0c5fa7516e" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 16 to add, 0 to change, 14 to destroy.
```
</details>